app/controllers/application_controller.rb

SELECT "trainers".* FROM "trainers" WHERE "trainers"."uid" = ? LIMIT ?  [["uid", "TbwKGdBYpDWePIjpg5gXtadhckz2"], ["LIMIT", 1]]
---
	def current_trainer
		@current_trainer ||= Trainer.find_by uid: request.headers['token']

SELECT "clients".* FROM "clients" WHERE "clients"."uid" = ? LIMIT ?  [["uid", "TbwKGdBYpDWePIjpg5gXtadhckz2"], ["LIMIT", 1]]
---
	def current_client
		@current_client ||= Client.find_by uid: request.headers['token']