app/controllers/clients_controller.rb

  def create
    @client = Client.new(client_params)

    if @client.save
---
INSERT INTO "clients" ("name", "lastname", "weight", "height", "goal", "time_active", "created_at", "updated_at", "uid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)