app/controllers/trainers_controller.rb

  def create
    @trainer = Trainer.new(trainer_params)

    if @trainer.save
---
INSERT INTO "trainers" ("name", "lastname", "birth_date", "time_acting", "qualifications", "availability", "uid", "created_at", "updated_at", "price") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)